### Roteiro da Semana ### 
####  Comparação SQL - PANDAS (2 dias) ####
####  Pré-processamento dos dados (Limpeza, Transformação ) - 1 dia #### 
#### Modelos de Regressão Linear - 2 dias  ####

In [119]:
import pandas as pd
import sqlite3 as sql

In [120]:
engine = sql.connect('aula3a.db')
cursor= engine.cursor()

In [121]:
url = "https://raw.github.com/pandas-dev/pandas/master/pandas/tests/io/data/csv/tips.csv"
tips= pd.read_csv(url)

### tips - Dataframe ####

In [122]:
tips.to_sql('tipsDB', con=engine)

In [6]:
### SQL - PANDAS - HEAD() ### 
sql_head = 'SELECT * FROM tipsDB LIMIT 5'
cursor.execute(sql_head).fetchall()

[(0, 16.99, 1.01, 'Female', 'No', 'Sun', 'Dinner', 2),
 (1, 10.34, 1.66, 'Male', 'No', 'Sun', 'Dinner', 3),
 (2, 21.01, 3.5, 'Male', 'No', 'Sun', 'Dinner', 3),
 (3, 23.68, 3.31, 'Male', 'No', 'Sun', 'Dinner', 2),
 (4, 24.59, 3.61, 'Female', 'No', 'Sun', 'Dinner', 4)]

In [7]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [10]:
tips.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [11]:
### SQL x PANDAS - INFO TABLE ####
sql_infoTable = 'PRAGMA table_info(tipsDB)'
cursor.execute(sql_infoTable).fetchall()

[(0, 'index', 'INTEGER', 0, None, 0),
 (1, 'total_bill', 'REAL', 0, None, 0),
 (2, 'tip', 'REAL', 0, None, 0),
 (3, 'sex', 'TEXT', 0, None, 0),
 (4, 'smoker', 'TEXT', 0, None, 0),
 (5, 'day', 'TEXT', 0, None, 0),
 (6, 'time', 'TEXT', 0, None, 0),
 (7, 'size', 'INTEGER', 0, None, 0)]

In [15]:
tips.info()
tips.sex.map(type)

0      <class 'str'>
1      <class 'str'>
2      <class 'str'>
3      <class 'str'>
4      <class 'str'>
           ...
239    <class 'str'>
240    <class 'str'>
241    <class 'str'>
242    <class 'str'>
243    <class 'str'>
Name: sex, Length: 244, dtype: object

In [18]:
### SQL x PANDAS - FILTRAR POR COLUNAS 
sql_columns = 'SELECT total_bill,tip,sex FROM tipsDB LIMIT 5'
cursor.execute(sql_columns).fetchall()

[(16.99, 1.01, 'Female'),
 (10.34, 1.66, 'Male'),
 (21.01, 3.5, 'Male'),
 (23.68, 3.31, 'Male'),
 (24.59, 3.61, 'Female')]

In [95]:
# Sintaxe para acesso às colunas do DATAFRAME 
# tips["nome_da_coluna"]
#tips.nome_da_coluna

# tips.total_bill

# várias colunas 
## tips[[list de colunas]]

tips[["total_bill","tip","sex"]].head()

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       21.01  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female

In [30]:
### SQL X PANDAS - ASSIGN 
sql_assign = 'SELECT *,tip/total_bill as tip_rate FROM tipsDB LIMIT 5'
cursor.execute(sql_assign)

cl=[]
for x in cursor.description:
    cl.append(x[0])

print(cl)
for row in cursor.fetchall():
    print(row)

['index', 'total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size', 'tip_rate']
(0, 16.99, 1.01, 'Female', 'No', 'Sun', 'Dinner', 2, 0.05944673337257211)
(1, 10.34, 1.66, 'Male', 'No', 'Sun', 'Dinner', 3, 0.16054158607350097)
(2, 21.01, 3.5, 'Male', 'No', 'Sun', 'Dinner', 3, 0.16658733936220846)
(3, 23.68, 3.31, 'Male', 'No', 'Sun', 'Dinner', 2, 0.1397804054054054)
(4, 24.59, 3.61, 'Female', 'No', 'Sun', 'Dinner', 4, 0.14680764538430255)

In [31]:
### ASSIGN - DATAFRAME ##### 
tips.assign(tip_rate=tips['tip']/tips['total_bill']).head()

   total_bill   tip     sex smoker  day    time  size  tip_rate
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [34]:
### SQL X PANDAS  -  WHERE  ####
sql_where = 'SELECT * FROM tipsDB WHERE time="Dinner" LIMIT 5'
cursor.execute(sql_where).fetchall()

[(0, 16.99, 1.01, 'Female', 'No', 'Sun', 'Dinner', 2),
 (1, 10.34, 1.66, 'Male', 'No', 'Sun', 'Dinner', 3),
 (2, 21.01, 3.5, 'Male', 'No', 'Sun', 'Dinner', 3),
 (3, 23.68, 3.31, 'Male', 'No', 'Sun', 'Dinner', 2),
 (4, 24.59, 3.61, 'Female', 'No', 'Sun', 'Dinner', 4)]

In [35]:
tips[tips["time"]=='Dinner'].head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [94]:
sql_where = 'SELECT * FROM tipsDB WHERE time="Dinner" AND tip > 3.00 AND tip < 4.00\
             AND(day="Sat" OR day="Sun") LIMIT 5'
cursor.execute(sql_where).fetchall()

[(2, 21.01, 3.5, 'Male', 'No', 'Sun', 'Dinner', 3),
 (3, 23.68, 3.31, 'Male', 'No', 'Sun', 'Dinner', 2),
 (4, 24.59, 3.61, 'Female', 'No', 'Sun', 'Dinner', 4),
 (7, 26.88, 3.12, 'Male', 'No', 'Sun', 'Dinner', 4),
 (9, 14.78, 3.23, 'Male', 'No', 'Sun', 'Dinner', 2)]

In [50]:
tips[(tips['time']=='Dinner')&(tips['tip'] > 3)&(tips['tip'] < 4)\
     & ((tips['day']=='Sun') | (tips['day']=='Sat'))].head()

   total_bill   tip     sex smoker  day    time  size
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
7       26.88  3.12    Male     No  Sun  Dinner     4
9       14.78  3.23    Male     No  Sun  Dinner     2

In [118]:
### save sql result into dataframe using pandas #### 

db_df = pd.read_sql_query('SELECT * FROM tipsDB WHERE time="Dinner" AND tip > 3.00 AND tip < 4.00\
             AND(day="Sat" OR day="Sun") LIMIT 5', engine)
db_df.to_csv('database.csv', index=False)
db_df

   index  total_bill   tip     sex smoker  day    time  size
0      2       21.01  3.50    Male     No  Sun  Dinner     3
1      3       23.68  3.31    Male     No  Sun  Dinner     2
2      4       24.59  3.61  Female     No  Sun  Dinner     4
3      7       26.88  3.12    Male     No  Sun  Dinner     4
4      9       14.78  3.23    Male     No  Sun  Dinner     2

In [124]:
sql_update='UPDATE tipsDB set tip=NULL where tip < 3.0'
cursor.execute(sql_update)
engine.commit()

In [127]:
sql_select = 'SELECT * FROM tipsDB where tip IS NULL LIMIT 5'
cursor.execute(sql_select).fetchall()

[(0, 16.99, None, 'Female', 'No', 'Sun', 'Dinner', 2),
 (1, 10.34, None, 'Male', 'No', 'Sun', 'Dinner', 3),
 (6, 8.77, None, 'Male', 'No', 'Sun', 'Dinner', 2),
 (8, 15.04, None, 'Male', 'No', 'Sun', 'Dinner', 2),
 (10, 10.27, None, 'Male', 'No', 'Sun', 'Dinner', 2)]

In [130]:
##  loc[row_index,name_column]
tips.head()
tips.loc[tips['tip']<3.0,'tip'] = None

In [137]:
#tips.isnull()

tips[tips['tip'].isna()].head()

#tips['tip'].isna()

    total_bill  tip     sex smoker  day    time  size
0        16.99  NaN  Female     No  Sun  Dinner     2
1        10.34  NaN    Male     No  Sun  Dinner     3
6         8.77  NaN    Male     No  Sun  Dinner     2
8        15.04  NaN    Male     No  Sun  Dinner     2
10       10.27  NaN    Male     No  Sun  Dinner     2

In [138]:
sql_groupBy ='SELECT sex,count(*) FROM tipsDB GROUP BY sex'
cursor.execute(sql_groupBy).fetchall()

[('Female', 87), ('Male', 157)]

In [139]:
tips.groupby('sex').mean()

sex
Female     87
Male      157
dtype: int64

In [142]:
sql_groupBy2 = 'SELECT day,smoker,count(*), avg(tip) from tipsDB\
                GROUP BY day, smoker'

cursor.execute(sql_groupBy2).fetchall()

[('Fri', 'No', 4, 3.25),
 ('Fri', 'Yes', 15, 3.6442857142857146),
 ('Sat', 'No', 45, 4.233181818181818),
 ('Sat', 'Yes', 42, 4.0169999999999995),
 ('Sun', 'No', 57, 4.040000000000001),
 ('Sun', 'Yes', 19, 3.9546666666666668),
 ('Thur', 'No', 45, 4.219285714285715),
 ('Thur', 'Yes', 17, 4.0525)]

In [158]:
tips.groupby(["day","smoker"]).agg({"tip":['max','min']})
### agg means aggregate #### 
###

               tip
               max  min
day  smoker
Fri  No       3.50  3.0
     Yes      4.73  3.0
Sat  No       9.00  3.0
     Yes     10.00  3.0
Sun  No       6.00  3.0
     Yes      6.50  3.0
Thur No       6.70  3.0
     Yes      5.00  3.0

Func : function, str, list or dict
Function to use for aggregating the data. If a function, must either work when passed a DataFrame or when passed to DataFrame.apply.
Accepted combinations are:
function
string function name
list of functions and/or function names, e.g. [np.sum, 'mean']
dict of axis labels -> functions, function names or list of such.
axis : {0 or ‘index’, 1 or ‘columns’}, default 0
If 0 or ‘index’: apply function to each column. If 1 or ‘columns’: apply function to each row.
*args
Positional arguments to pass to func.
**kwargs
Keyword arguments to pass to func.

In [156]:

tips.aggregate({"total_bill":['max', 'min'], 
              "tip":['mean', 'max']})

      total_bill        tip
max        50.81  10.000000
mean         NaN   4.039835
min         3.07        NaN

#### Function Lambda 
#### "Em Python, existe um conceito bastante poderoso e integrado à linguagem que é chamado
#### de expressão lambda ou forma lambda. O conceito em si é bastante simples: 
#### consiste em uma função que é atribuida a um objeto. Por conter a palavra
#### reservada lambda o objeto se comportará como uma função."

In [148]:
import numpy as np 
A = lambda x: np.mean(x)
A([1,2,3,4,5])

3.0

In [ ]:
values = np.random.randn(4)
values = np.append(values,np.nan)

df1 = pd.DataFrame({"key": ["A", "B", "C", "D","E"], "value": values})
df2 = pd.DataFrame({"key": ["B", "D", "D", "E"], "value": np.random.randn(4)})


df1.to_sql('df1DB', con=engine)
df2.to_sql('df2DB', con=engine)

In [52]:
#### JOINS - MERGE PANDAS ######

#### DATA WRANGLING #####  
#### Pré-processamento dos dados ##### 
dfClean = pd.read_csv('dirtydata.csv')
dfClean

In [ ]:
header_list = ["personid", "firstname", "middleinitial","lastname","dateofbirth"]
path_file = "/Users/charles/Documents/Infnet/Semana4/Sample/SamplePersonData"
df_Person = pd.read_csv(path_file, names=header_list)
df_Person

In [ ]:
header_list = ["studentid", "personid", "email"]
path_file = "/Users/charles/Documents/Infnet/Semana4/Sample/SampleStudentData"
df_Student = pd.read_csv(path_file, names=header_list)
df_Student

In [ ]:
header_list = ["courseid", "name", "teacher"]
path_file = "/Users/charles/Documents/Infnet/Semana4/Sample/SampleCourseData"
df_Course = pd.read_csv(path_file, names=header_list)
df_Course

In [ ]:
header_list = ["studentid", "courseid", "grade","attempt"]
path_file = "/Users/charles/Documents/Infnet/Semana4/Sample/SampleCreditData"
df_Credit = pd.read_csv(path_file, names=header_list)
df_Credit